app/views/carts/_cart.html.erb

SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 9)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 10)
---
<% unless cart.line_items.empty? %>