app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2011-04-12 11:40:36.375000', '2011-04-12 11:40:36.375000')
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "quantity", "order_id") VALUES (2, 13, '2011-05-31 13:07:45.953125', '2011-05-31 13:07:45.953125', 1, NULL)
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2011-05-24 13:17:50.328125' WHERE "line_items"."id" = 6
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save