app/controllers/orders_controller.rb

  def new

    @cart = current_cart
    if @cart.line_items.empty?
---
SELECT "line_items".* FROM "line_items" WHERE ("line_items".cart_id = 13)
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 13)

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES ('Tarik', 'Pipapo', 'pipapo@pipapo.pipa', 'Check', '2011-05-31 13:08:28.640625', '2011-05-31 13:08:28.640625')
DELETE FROM "carts" WHERE "carts"."id" = 14