app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES ('MyString', 'MyText', 'MyString', 9.99, '2011-03-15 13:57:09.000000', '2011-03-15 13:57:09.000000')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.valid? && @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 2 ORDER BY title LIMIT 1
UPDATE "products" SET "title" = 'Lorem Ipsum', "description" = 'Wibbles are fun!', "image_url" = 'lorem.jpg', "price" = 19.95, "updated_at" = '2011-03-22 14:30:23.921875' WHERE "products"."id" = 980190962
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.valid? && @product.update_attributes(params[:product])